# ReDraw

## Description
Procedure ReDraw invokes a screen redraw of newly created objects in the active Vectorworks document. If new objects are to be manipulated using procedures which operate on selected objects, a call to ReDraw should precede the selected object routines to ensure that all new objects are correctly identified.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE ReDraw;
```

```python

def vs.ReDraw():
    return None
```

## Version
Availability: from MiniCAD
## Category
* Utility